import 'package:flutter/material.dart';
import 'package:god_eye_beta/pages/home_page.dart';

class Result extends StatelessWidget {
  final String signName;
  final int questionIndex;

  Result(this.signName, this.questionIndex);

  final _god_eye_answer = const [
    {
      'questionText':
          "ချစ်သူနဲ့..စိတ်သဘောထားမတိုက်ဆိုင်ဖြစ်နေတယ်ပြန်အဆင်ပြေနိုင်ပါ့မလား။",
      'answer': {
        'jupiter': "နည်းနည်းကြာဦးမယ်။သင့်ဘက်က...အလျော့ပေးမှပြီးမယ်။ ",
        'saturn': 'သင့်အလျော့ပေးရင်အဆင်ပြေမယ်။ စိတ်လျော့ထားလိုက်ပါ။',
        'sun': 'သင်ကမှန်တာမို့ဆက်တင်းခံထားပါဦး။ပြန်အဆင်ပြေမယ်။',
        'mercury': 'ချက်ခြင်းအဆင်မပြေနိင်ဘူး။တစ်လကျော်ထိကြာနိုင်တယ်။',
        'venus': 'ရက်သိပ်မကြာခင် သူပြန်ချော့လိမ့်မယ်အေးဆေးစောင့်ပါ။',
        'moon': 'သူကမှန်နေတာမို့ သင့်ဘက်ကလျော့ပေးမှအဆင်ပြေနိုင်မယ်။',
        'cancer': 'နောက်တစ်လလောက်ထိတော့ကြာနေဦးမှာအသေအချာ။',
        'pisces': 'မနက်ဖြန် ပြေလည်ပြီး တစ်ပတ်ကြာရင်ပြန်စကားများကြမယ်။',
        'aries': 'သူဘက်ကအလျော့ပေး(ကတိပေး)ပြီးပြန်အဆင်ပြေမယ်။',
        'capricorn': 'သင်ကိုယ်တိုင်အချိုးမပြောင်းရင် အဆင်မပြေဆက်ဖြစ်နေမှာပဲ။',
        'taurus': 'မကြာခင်မှာသူပြန်ချော့လိမ့်မယ်။ဆက်ပြီးတောင့်ခံထားပါ။',
        'libra': 'နှစ်ယောက်လုံးကတင်းမာနေတော့..သိပ်မမြန်နိုင်သေးပါဘူး။',
        'mars': 'တစ်ပတ်လောက်အတွင်းမှာ ပြန်ပြီးပြေလည်သွားပါလိမ့်မယ်။',
        'leo': 'မလွယ်ဘူး။သင့်ဘက်ကမလျော့ရင်လမ်းခွဲဖြစ်သွားနိုင်တယ်။',
        'virgo': 'အချိန်ကြာလေပိုဆိုးလေဖြစ်မယ်။သင်ကချော့ဖို့စဉ်းစာပါ။',
        'Sagittarius': 'သင့်ဘက်က အလျော့ပေးနိုင်မှ အဆင်ပြေလိမ့်မယ်။',
      },
    },
    {
      'questionText':
          " အချစ်ရေးမှာ...ပြိုင်ဘက်တစ်ယောက်ရှိနေတယ်ဘာတွေဆက်ဖြစ်လာမလဲ။",
      'answer': {
        'jupiter': 'သင်ပဲ...အနိုင်ရမှာပါ။ဘာကိုမှ သိပ်စိတ်ပူနေဖို့မလိုပါဘူး။',
        'saturn': 'ပြိုင်ဘက်က သင့်လိုမရိုးသားဘူးလေ။ သင်ပဲအနိုင်ရမှာပါ။',
        'sun': 'ပြိုင်ဘက်က သင့်ကိုမယှဉ်နိုင်ပါဘူး။လုံးဝမစိုးရိမ်ပါနဲ့။',
        'mercury': 'ပြိုင်ဘက်ကတစ်ယောက်မကဘူးနော်။သင်ပဲ အနိုင်ရမှာပါ။',
        'venus': 'ပြိုင်ဘက်ထပ်များနိုင်တယ်။သင်ပဲ အောင်နိုင်သူဖြစ်မယ်။',
        'moon': 'ပေါ့ပေါ့ဆဆ နေမိရင်တော့ သင်အရှုံးနဲ့ရင်ဆိုင်ရလိမ့်မယ်။',
        'cancer': 'သင့်ကိုဒုက္ခပေးနိုင်တဲ့ပြိုင်ဘက်ပါပဲ။ကြိုးစားမှအနိုင်ရမယ်။',
        'pisces': 'သင်အနိုင်ရဖို့မလွယ်ဘူး။အချစ်သစ်နဲ့တွေ့နိုင်တော့မှာပါ။',
        'aries': 'အရှုံးပေးရမှာပဲ။ပိုကောင်းတဲ့အချစ်သစ်တစ်ယောက်ရှာပေါ့။',
        'capricorn': 'သင့်ကိုယှဉ်နိုင်တဲ့ပြိုင်ဘက်မျိုးမဟုတ်ဘူး။စိတ်ပူမနေနဲ့။',
        'taurus': 'မနာလိုစိတ်ဖျောက်ပြီးခွင့်လွတ်နိုင်ရင်သင်ပဲအနိုင်ရမှာပါ။',
        'libra': 'ပြိုင်ဘက်က..အစွမ်းအစမရှိပါဘူး။သင်ဘဲ..အနိုင်ရမှာပါ။',
        'mars': 'ပြိုင်ဘက်ကအရည်အချင်းရှိတာမို့သင်အရှုံးပေးရလိမ့်မယ်။',
        'leo': 'စိတ်အနှောက်အယှက်ဖြစ်မနေပါနဲ့။သင်ဘဲအနိုင်ရမှာပါ။',
        'virgo': 'သင့်အားနည်းချက်ကိုမပြင်နိုင်ရင်တော့ရှုံးသွားလိမ့်မယ်။',
        'Sagittarius': 'ပြိုင်ဘက်ဟာ သင့်ကြောင့်အရှုံးပေးသွားရပါလိမ့်မယ်။',
      },
    },
    {
      'questionText':
          "အခုတွဲနေတဲ့ချစ်သူဟာ...ဘဝအတွက်လက်တွဲဖော်အစစ်ဖြစ်လာနိုင်မလား။",
      'answer': {
        'jupiter': 'သင်တွဲနေတဲ့သူဟာ...ဘဝအတွက်လက်တွဲဖော်အစစ်အမှန်ပါပဲ။',
        'saturn': 'လက်တွဲဖော်အစစ်က...ရပ်ဝေးမြေခြားမှာရောက်နေသူပါ။',
        'sun': 'မဖြစ်နိုင်ပါဘူး။နောက်တွဲမယ့်သူကမှ...လက်တွဲဖော်အစစ်ပါ။',
        'mercury': 'သူမဖြစ်နိုင်ဘူး။သင့်သူငယ်ချင်းအသစ်က လက်တွဲဖော်ပဲ။',
        'venus': 'မဖြစ်နိုင်ပါဘူး။လက်တွဲဖော်အစစ်က အသက်ပိုကြီးတယ်။',
        'moon': 'သူနဲ့ပဲလက်တွဲရလိမ့်မယ်။သိပ်တော့မချမ်းသာနိုင်ဘူး။',
        'cancer': 'လက်တွဲဖော်ဖြစ်မယ့်သူဟာ နောက်တွေ့ကြုံရမယ့်လူပါပဲ။',
        'pisces': 'တတိယမြောက်ချစ်သူဟာ အစစ်အမှန်လက်တွဲဖော်ပါပဲ။',
        'aries': 'နောက်တစ်ယောက်ထပ်တွေ့ဦးမယ်။အဲ့ဒါလက်တွဲဖော်ပါ။',
        'capricorn': 'အမှန်အကန် လက်လွဲ ဖော်ဖြစ်လာမယ်။ပျော်ရွှင်ရလိမ့်မယ်။',
        'taurus': 'သူကလက်တွဲဖော်မဖြစ်နိုင်ဘူး။နောက်လူကဖြစ်မယ်။',
        'libra': 'တွဲနေပေမယ့်သင်မချစ်ပါဘူး။ရေရှည်မှာဖြစ်မလာနိုင်ဘူး။',
        'mars': 'လက်တွဲဖော်အစစ်မဟုတ်သေးပါဘူး။စိတ်ကစားနေတာပါ။',
        'leo': 'ခုတွဲနေတာသူငယ်ချင်း။ချစ်သူကိုနောက်မဆုံနိုင်မယ်။',
        'virgo': 'စိတ်ကူးယဉ်အဖော်ပါပဲ။လက်တွဲဖော်မဖြစ်လာသေးပါဘူး။',
        'Sagittarius':
            'လက်တွဲဖော်အစစ်ကို နောက်သုံးနှစ်မှဆုံနိုင်ခွင့်ရလိမ့်မယ်။',
      },
    },
    {
      'questionText':
          "လိုချင်တာတွေမရလို့..သူ့ကိုစိတ်ကောက်ပြနေတာဖြစ်ပြီးအလျော့ပေးလိုက်ရတော့မလား။",
      'answer': {
        'jupiter': 'အလျော့ပေးလိုက်ပါတော့။ လိုချင်သမျှ...ရလာပါလိမ့်မယ်။',
        'saturn': 'အလျော့မပေးလိုက်ပါနဲ့။ ဘာမှရနိုင်တော့မှာ...မဟုတ်ဘူး။',
        'sun': 'နောက်၃ရက်ကြာလို့ သူမချော့ရင် လျော့လိုက်ပါတော့။',
        'mercury': 'လျော့ပေးလိုက်ပါ။လိုချင်တာအားလုံးတော့မရနိုင်ဘူးနော်။',
        'venus': 'ဆက်တောင့်ထားလိုက်။မကြာခင်လိုချင်တာတွေရမယ်။',
        'moon': 'ဘာမှမရနိုင်ပါဘူး။စိတ်ကောက်တာပဲအဖက်တင်လိမ့်မယ်။',
        'cancer': 'အလျော့မပေးလိုက်နဲ့နော်။သူကချော့ဖို့စဉ်းစားနေပြီ။',
        'pisces': 'စမိမှတော့ပြန်မဆုတ်နဲ့။မကြာခင်ထူးခြားလာလိမ့်မယ်။',
        'aries': 'အလျော့ပေး ပြီးရင်အမြဲရှုံးနေမယ်။ဆက်သာတောင့်ထား။',
        'capricorn': 'သူကနိုင်မယ်ထင်နေတာ။သူရှုံးသွားမှာ အသေအချာပါပဲ။',
        'taurus': 'စိတ်ဆက်ကောက်နိုင်ရင်တော့ လိုချင်တာတွေရပါလိမ့်မယ်။',
        'libra': 'အလျော့ပေးလိုက်ပါ။နောက်ပိုင်းမှာလိုချင်တာတွေရမှာပါ။',
        'mars': 'သူစိတ်ပြေအောင်ချော့နိုင်ရင်လိုချင်တာတွေရပါလိမ့်မယ်။',
        'leo': 'အလျော့မပေးလိုက်နဲ့ဦး။သင့်ဘက်ကအနိုင်ရတော့မှာပါ။',
        'virgo': 'ဆက်ပြီးစိတ်ကောက်နေရင် ပြသနာတွေဖြစ်လာလိမ့်မယ်။',
        'Sagittarius': 'အလျော့ပေးနိုင်ရင်တော့ အကောင်းေုံးဖြစ်လာမှာပါပဲ။',
      },
    },
    {
      'questionText':
          "သူကစေ့စပ်ထားချင်တယ်တဲ့ လက်ခံလိုက်ရင်ကောင်းမလား။ဘာဆက်လုပ်မလဲ။",
      'answer': {
        'jupiter': 'မေတ္တာစစ်နဲ့...သူခွင့်တောင်းနေတာပဲ။ လက်ခံလိုက်ပေါ့။',
        'saturn': 'စေ့စပ်ပြီးရင်...စိတ်ညစ်ရမှာအသေအချာပဲ။ ငြင်းလိုက်ပါ။',
        'sun': 'စေ့စပ်လိုက်ရင်မှားမယ်။ဖူးစာရှင်အစစ်ကသူမဟုတ်ဘူး။',
        'mercury': 'သင့်အတွက် စိတ်ညစ်နေရမယ်နော်။လက်မခံသင့်ပါဘူး။',
        'venus': 'လက်ခံလိုက်ပါ။သင့်ရဲ့နောင်ရေးအတွက်စိတ်အေးရမယ်။',
        'moon': 'အချိန်စောနေပါသေးတယ်။တစ်နှစ်လောက်စောင့်ခိုင်းပါဦး။',
        'cancer': 'ငြင်းလိုက်ပါ။ သူနဲ့လက်ထပ်ဖို့က သိပ်မသေချာနိုင်ဘူး။',
        'pisces': 'လက်ခံလိုက်ပါ။စိတ်ချမ်းသာပြီးပျော်ပျော်ရွှင်နေရမယ်။',
        'aries': 'စိတ်ဆင်းရဲစရာတွေအများကြီးကြုံလာနိုင်တာမို့ငြင်းလိုက်ပါ။',
        'capricorn': 'တတိယမြောက်ရည်းစားကသင်မျော်လင့်ထားတဲ့သူပါပဲ။',
        'taurus': 'ခုရှုပ်မှနောင်ရှင်း လက်မခံဘူးလို့အပြတ်သာငြင်းလိုက်ပါ။',
        'libra': 'လက်ခံသင့်တယ်။ဘဝနောင်ရေးအတွက်ခိုင်မာသွားတာပေါ့။',
        'mars': 'စေ့စပ်ပြီးမှစိတ်မညစ်ချင်ရင် စောစောသာငြင်းဆန်လိုက်ပါ။',
        'leo': 'ပျော်ချင်ရင်ဒီအတိုင်းဆက်နေ။ စိတ်ညစ်ချင်ရင်ခေါင်းငြိမ့်။',
        'virgo': 'စေ့စပ်ပြီးရင်ပြသနာတက်လာနိုင်ပါတယ်။လက်မခံပါနဲ့။',
        'Sagittarius': 'သူ့ဘက်ကအလေးအနက်ထားတာပဲ။လက်ခံသင့်ပါတယ်။',
      },
    },
    {
      'questionText':
          "ကိုယ့်ဘက်ကသိပ်ချစ်မြတ်နိုးရသူတစ်ယောက်နဲ့ တွေ့ခွင့်၊ဆုံခွင့်ကြုံနိုင်ပါ့မလား။",
      'answer': {
        'jupiter': 'သင့်သူငယ်ချင်းတွေထဲမှာ သူပါနေပြီ။ တွေ့အောင်ရှာပေါ့။',
        'saturn':
            'ကိုယ်ချစ်နဲ့ဆုံဖို့မဖြစ်နိုင်ဘူး။ သူချစ်ကိုပဲရွေးချယ်လိုက်ပါ။',
        'sun': 'နောက်၆လကျော်ပြီးမှ တွေ့၊ဆုံ၊ကြုံ နိုင်ခွင့်ရမယ်။',
        'mercury': 'အချစ်ကံကြမ္မာကောင်းနေတာမို့ မကြာခင်ဆုံတော့မယ်။',
        'venus': 'သင်ကမချစ်တတ်သူမို့ ကြုံဆုံနိုင်ဖို့ဆိုတာမဖြစ်နိုင်ပါဘူး။',
        'moon': 'သင်ကချစ်ပေမယ့်သူကသင့်ကိုချစ်နေမှာမဟုတ်ဘူးနော်။',
        'cancer': 'ရည်းစားမများပါစေနဲ့။အသေအချာဆုံနိုင်ခွင့်ရှိနေတယ်။',
        'pisces': 'ဆုံတော့ဆုံလိမ့်မယ်။ စိတ်ရှုပ်ထွေးပြီးပြသနာတတ်ရမယ်။',
        'aries': 'မျှော်လင့်ချက်မရှိဘူး။ သူချစ်နဲ့ပဲဖူးစာဆုံနိုင်ပါလိမ့်မယ်။',
        'capricorn': 'ပြန်ဆုံနိုင်ပေမယ့် သူ့မှာအသစ်တစ်ယောက်ရှိနေပြီနော်။',
        'taurus': 'ရည်းစားမများစေနဲ့။မကြာခင်မှာ ကြုံဆုံခွင့်ရပါလိမ့်မယ်။',
        'libra':
            'ကြုံခွင့်ဆုံခွင့်ရနိုင်ပေမယ့်..ပေါင်းဖက်ခွင့်တော့မရနိုင်ပါဘူး။',
        'mars': 'သူကသင့်နံဘေးမှာရှိနေပြီ။သင်သတိမထားမိသေးတာပါ။',
        'leo': 'အသေအချာ..ဆုံနိုင်ခွင့်ရမှာပါ။ပျော်လည်းပျော်ရွင်ရမှာပါ။',
        'virgo': 'ကြုံဆုံခဲ့ပြီးပြီ။နောက်တစ်ခါအခွင့်အရေးမရှိတော့ဘူး။',
        'Sagittarius': 'တွေ့ဆုံရတော့မှာပါ။သုံးလလောက်ပဲ...စောင့်ရတော့မှာပါ။',
      },
    },
    {
      'questionText':
          "ချစ်သူနဲ့ကွဲကွာနေတာပြန်ဆုံခွင့်ရပါ့မလား။ဘယ်အချိန်မှာပြန်ဆုံခွင့်ရမလဲ။",
      'answer': {
        'jupiter': 'ပြန်ဆုံတွေ့ကြဦးမှာပါ။သူငယ်ချင်းတွေလို အဖြစ်မျိုးနဲ့ပေါ့',
        'saturn': 'ခြောက်လအတွင်းမှာ ပြန်လည်ဆုံတွေ့ခွင့်ရနိုင်ပါလိမ့်မယ်။',
        'sun': 'သိပ်မမျှော်လင့်ပါနဲ့တော့။သူ့စိတ်ဓာတ်တွေပြောင်းသွားပြီ။',
        'mercury': 'ပြန်ဆုံနိုင်ပါတယ်။စိတ်ရှည်ရှည်နဲ့ဆက်သာစောင့်နေပါ။',
        'venus': 'သူကသင့်ကိုမချစ်တော့ပါဘူး။မျော်လင့်မနေပါနဲ့တော့။',
        'moon': 'တစ်နှစ်ကျော်ထိကြာနိုင်ပါတယ်။ဖးူစာကံမပါတဲ့သူပါပဲ။',
        'cancer': 'မဆုံနိုင်ပါဘူး။သင့်ဘက်က စိတ်မောနေရုံပဲဖြစ်လိမ့်မယ်။',
        'pisces': 'စိတ်မှာမေ့ဖျောက်လို့ အသစ်တစ်ယောက်ပဲရှာသင့်ပါတယ်။',
        'aries': 'ဆုံနိုင်ခွင့်ရကြမှာပါ။ နှစ်နှစ်ထက်တော့ပိုမကြာနိင်ပါဘူး။',
        'capricorn': 'သူကအမှန်အကန်တွေပြောနေတာပါ။ယုံကြည်လိုက်ပါ။',
        'taurus': 'မကြာခင်ပြန်ဆုံရမှာပါ။ပျော်ရွှင်စရာပြန်ဖြစ်လာပါလိမ့်မယ်။',
        'libra': 'ပြန်ဆုံနိုင်ပေမယ့်အရင်လိုပျော်စရာမကောင်းနိုင်တော့ဘူး။',
        'mars': 'ကွဲနေတဲ့သူနဲ့ပြန်ဆုံရင်စိတ်ရှုပ်ထွေးစရာပြဿနာဖြစ်နိုင်တယ်။',
        'leo': 'သုံးလေးနှစ်ကြာနိုင်တယ်။ သင်စောင့်နိုင်မှာမဟုတ်ပါဘူး။',
        'virgo': 'ကွဲကွာနေသူနဲ့ပြန်ဆုံရမယ်။စိတ်ချမ်းသာရမယ်။',
        'Sagittarius': 'ပြန်မဆုံသင့်တော့တဲ့အချိန်အနေတစ်ခု.သူ့မှာရှိနေတယ်။',
      },
    },
    {
      'questionText':
          "ချစ်သူပြောတဲ့စကားတွေဟာရင်တွင်းဖြစ်အစစ်အမှန်တွေလား ယုံကြည်လိုက်ရမလား။",
      'answer': {
        'jupiter': 'ရင်ထဲက...စကားလုံးအစစ်အမှန်တွေပါ။ယုံကြည်လိုက်ပါ။',
        'saturn': 'ရင်ထဲကတွေ့ရာစကားလုံးတွေပါ။ယုံမိရင်ဒုက္ခများမယ်နော်။',
        'sun': 'သူကစကားအမှန်မပြောတတ်တာ သင်သိနေတာပဲလေ။',
        'mercury': 'ခံစားချက်နဲ့ပြောတာအမှန်။ဖြစ်မြောက်အောင်မကြိုးစားဘူး။',
        'venus': 'ယုံကြည်လိုက်ပါ။သူရင်ထဲကခံစားချက်တွေပြောပြနေတာပဲ။',
        'moon': 'ယုံကြည်လိုက်ပါ။သူ့ရင်ထဲကခံစားချက်တွေပြောပြနေတာပဲ။',
        'cancer': 'အားလုံးတော့မယုံလိုက်ပါနဲ့။ဒုက္ခရောက်သွားနိုင်တယ်။',
        'pisces': 'ငွေကြေးကိစ္စကလွဲပြီး အတော်များများကအစစ်အမှန်ပါ။',
        'aries': 'နည်းနည်းတော့ အလိမ်အညာတွေ ပါနေတယ်။မယုံပါနဲ့။',
        'capricorn': 'အဲ့ဒီနှစ်ယောက်မှာ အသက်နည်းနည်းပိုကြီးတဲ့သူပေါ့။',
        'taurus': 'ရင်ထဲမှာလုံးဝမရှိတဲ့ အပြင်ကစကားတွေပြောပြနေတာပါ။',
        'libra': 'ရင်ထဲကဖြစ်တာအစစ်မဟုတ်ဘူး။ယုံကြည်လို့မရပါဘူး။',
        'mars': 'သူကမှန်မှန်ကန်ကန်တွေဘဲပြောတက်တဲ့သူပါ။ယုံလိုက်ပါ။',
        'leo': 'သူ့စကားအများစုဟာရင်ထဲကအမှန်အကန်ပြောနေတာပါ။',
        'virgo': 'ကြုံသလိုပြောလိုက်တာမို့ယုံလိုက်ရင်မှားသွားမယ်။',
        'Sagittarius': 'သူပြောတာ တော်တော်များများက..အမှန်တွေပါ။ယုံလိုက်ပါ။',
      },
    },
    {
      'questionText':
          "သံယောဇဉ်ဖြစ်နေမိတဲ့နှစ်ယောက်မှာဘယ်သူကကိုယ့်ကိုပိုပီးချစ်မြတ်နိုးမှာလဲ။",
      'answer': {
        'jupiter': 'ရုပ်ကသိပ်မချောပေမယ့်...အရပ်နည်းနည်းပိုရှည်တဲ့လူပေါ့',
        'saturn': 'နောက်ပိုင်းမှာမှ သံယောဇဉ် ဖြစ်လာမိတဲ့တစ်ယောက်ပါ။',
        'sun': 'ပထမချစ်ခဲ့မိသူက နောက်လူထက်ပိုချစ်မြတ်နိုးပါတယ်။',
        'mercury': 'အဲ့ဒီနှစ်ယောက်မှာ သူကအသားနည်းနည်းပိုဖြူတယ်လေ။',
        'venus': 'သိပ်ရယ်ရယ်မောမောမနေဘဲ ခပ်တည်တည်နေတတ်တဲ့သူ။',
        'moon': 'နှစ်ယောက်စလုံးက အပေါ်ယံရွှေမှုန်ကြဲထားသူတွေပါပဲ။',
        'cancer': 'သင့်ကိုပျော်ရွှင်အောင် အမြဲတမ်းနောက်ပြောင်နေသူပါပဲ။',
        'pisces': 'နှစ်ယောက်မှာ စာကြည့်မျက်မှန်တပ်နေရတဲ့တစ်ယောက်။',
        'aries': 'နှစ်ယောက်စလုံး အလေးအနက်မရှိဘူးဆိုတာသိထားပါ။',
        'capricorn': 'ပြသနာမဖြစ်ချင်ရင် ဝေးဝေးကရှောင်နေပေးလိုက်တော့။',
        'taurus': 'စကားပြောရင်စိတ်မရှည်တဲ့သူ။စိတ်တိုနေတတ်တဲ့သူပါပဲ။',
        'libra': 'သင့်စိတ်ထဲမှာ သိပ်သဘောမကျပဲဖြစ်နေတဲ့တစ်ယောက်။',
        'mars': 'အသားနည်းနည်းညိုသူဟာ..သင့်ကိုပိုချစ်တာအမှန်ပါဘဲ။',
        'leo': 'သူကအဝတ်အစားအရောင်နုနုတွေပဲအမြဲဝတ်တယ်လေ။',
        'virgo': 'အသက်ငယ်တဲ့သူဟာ အမှန်တကယ်ချစ်မြတ်နိုးနေသူပါ။',
        'Sagittarius': 'သူ့ကိုကြည့်လိုက်ရင်အမြဲတမ်းပြုံးပျော်နေတတ်တဲ့သူပေါ့။',
      },
    },
    {
      'questionText':
          "သူ့ဘက်ကအမှားတွေလုပ်နေပီးဆက်ပြီးလက်တွဲနေဖို့ဖြစ်နိုင်ပါ့မလား။",
      'answer': {
        'jupiter': 'မှားပြီးရင် ဆက်မှားနေမှာပဲ။ လက်တွဲသူပါနစ်နာနိုင်တယ်။',
        'saturn': 'လုံးဝမဖြစ်နိုင်တော့ဘူး။လက်တွဲသာ...ဖြုတ်လိုက်ပါတော့။',
        'sun': 'အထင်လွဲနေတာပါ။စိတ်ရှည်ရှည်နဲ့ဆက်စောင့်ကြည့်ပါဦး၊',
        'mercury': 'ပြန်ပြင်ဆင်ဖို့အချိန်ရှိပါသေးတယ်။ရအောင်ပြင်ခိုင်းပေါ့။',
        'venus': 'ဆက်ပြီးမှားနေဦးမှာမို့ လမ်းခွဲဖို့သာပြင်ဆင်ထားပါတော့။',
        'moon': 'နည်းနည်းမှားမိတာမို့ တစ်ကြိမ်တစ်ခါခွင့်လွှတ်ပေးလိုက်ပါ။',
        'cancer': 'ပြန်ကောင်းလာဖို့မျော်လင့်ရင် စိတ်ပင်ပန်းနေရလိမ့်မယ်။',
        'pisces': 'လက်တွဲဖြုတ်ပြီးမေ့ပစ်လိုက်တာကအကောင်းဆုံးပါပဲ။',
        'aries': 'သူကြောင့်သင်ပါနာမည်ပျက်နိုင်တာမို့ လမ်းခွဲလိုက်ပါတော့။',
        'capricorn': 'ပြောင်းလဲမယ်။ သင်ကိုယ်တိုင်အသစ်တစ်ယောက်တွေ့မယ်။',
        'taurus': 'စိတ်လျော့ပြီးသည်းခံနေလိုက်ပါ။ပြန်ကောင်းလာမှာပေါ့။',
        'libra': 'သင့်နောင်ရေးတွေရှုပ်ထွေးသွားမယ်။နောက်ဆုတ်လိုက်ပါ။',
        'mars': 'နောက်ထပ်လည်းမှားနေဦးမှာဘဲ။သူ့ကိုမေ့ပစ် လိုက်ပါတော့။',
        'leo': 'မမျှော်',
        'virgo': 'သူ့ကိုနောက်ဆုံးအကြိမ် ခွင့်လွှတ်ပေးသင့်တယ်။',
        'Sagittarius': 'ပြင်ဆင်ပေဖို့မကြိုးစားပါနဲ့။သင်ပါဒုက္ခရောက်သွားတယ်။',
      },
    },
  ];
  String _answerString() {
    var temp = _god_eye_answer[questionIndex]['answer'] as Map<String, Object>;
    return temp[signName].toString();
  }

  void _backToQuestion(BuildContext context){
    Navigator.pushAndRemoveUntil(
      context,
      MaterialPageRoute(
          builder: (context) =>HomePage()),
          (Route<dynamic> route)=> false,
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Container(
        decoration: BoxDecoration(
          image: DecorationImage(
              image: AssetImage('assets/images/background.jpg'),
              fit: BoxFit.cover),
        ),
        child: Center(
          child: Card(
            margin: EdgeInsets.symmetric(horizontal: 15),
            child: ListTile(
              title: Column(
                mainAxisSize: MainAxisSize.min,
                children: [
                  SizedBox(height: 15),
                  TitleText('မွေးခွန်း'),
                  Text(_god_eye_answer[questionIndex]['questionText']
                      .toString()),
                  Divider(color: Colors.black),
                  TitleText('အဖြေ'),
                  Text(_answerString()),
                  SizedBox(height: 30),
                  ElevatedButton(
                    onPressed:()=> _backToQuestion(context),
                    child: Text("မွေးခွန်းထပ်မေးမယ်"),
                  ),
                  SizedBox(height: 15),
                ],
              ),
            ),
          ),
        ),
      ),
    );
  }
}

class TitleText extends StatelessWidget {
  final String title;

  TitleText(this.title);

  @override
  Widget build(BuildContext context) {
    return Text(
      title,
      style: TextStyle(fontWeight: FontWeight.bold),
    );
  }
}
